<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#DataFrame的创建：利用包含等长度列表或Numpy数组的字典，字典的键将作为columns" data-toc-modified-id="DataFrame的创建：利用包含等长度列表或Numpy数组的字典，字典的键将作为columns-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>DataFrame的创建：利用包含等长度列表或Numpy数组的字典，字典的键将作为columns</a></span></li><li><span><a href="#frame.head()：显示DataFrame的前5行" data-toc-modified-id="frame.head()：显示DataFrame的前5行-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>frame.head()：显示DataFrame的前5行</a></span></li><li><span><a href="#向DataFrame传入columns参数，将按照指定顺序排序columns，如果传入的列不包含在字典的键中，将在结果中出现缺失值" data-toc-modified-id="向DataFrame传入columns参数，将按照指定顺序排序columns，如果传入的列不包含在字典的键中，将在结果中出现缺失值-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>向DataFrame传入columns参数，将按照指定顺序排序columns，如果传入的列不包含在字典的键中，将在结果中出现缺失值</a></span></li><li><span><a href="#向DataFrame传入index参数作为行索引" data-toc-modified-id="向DataFrame传入index参数作为行索引-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>向DataFrame传入index参数作为行索引</a></span></li><li><span><a href="#检索DataFrame中的一列，可按字典型标记或属性来检索，也即frame2['state']或frame2.year" data-toc-modified-id="检索DataFrame中的一列，可按字典型标记或属性来检索，也即frame2['state']或frame2.year-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>检索DataFrame中的一列，可按字典型标记或属性来检索，也即frame2['state']或frame2.year</a></span></li><li><span><a href="#检索行，使用loc来检索" data-toc-modified-id="检索行，使用loc来检索-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>检索行，使用loc来检索</a></span></li><li><span><a href="#修改列：空的'debt'可赋值为标量值或值数组" data-toc-modified-id="修改列：空的'debt'可赋值为标量值或值数组-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>修改列：空的'debt'可赋值为标量值或值数组</a></span></li><li><span><a href="#将Series赋值给一列，Series的索引将按照DataFrame的索引重新排列，并在空缺的位置上填充缺失值" data-toc-modified-id="将Series赋值给一列，Series的索引将按照DataFrame的索引重新排列，并在空缺的位置上填充缺失值-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>将Series赋值给一列，Series的索引将按照DataFrame的索引重新排列，并在空缺的位置上填充缺失值</a></span></li><li><span><a href="#del-关键字来删除DataFrame中的列" data-toc-modified-id="del-关键字来删除DataFrame中的列-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>del 关键字来删除DataFrame中的列</a></span></li><li><span><a href="#DataFrame的创建：利用包含字典的嵌套字典，字典的键将作为columns，内部字典的键将作为index" data-toc-modified-id="DataFrame的创建：利用包含字典的嵌套字典，字典的键将作为columns，内部字典的键将作为index-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>DataFrame的创建：利用包含字典的嵌套字典，字典的键将作为columns，内部字典的键将作为index</a></span></li><li><span><a href="#转置，frame3.T" data-toc-modified-id="转置，frame3.T-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>转置，frame3.T</a></span></li><li><span><a href="#name属性" data-toc-modified-id="name属性-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>name属性</a></span></li><li><span><a href="#values属性：DataFrame中的数据以二维数组的形式返回" data-toc-modified-id="values属性：DataFrame中的数据以二维数组的形式返回-13"><span class="toc-item-num">13&nbsp;&nbsp;</span>values属性：DataFrame中的数据以二维数组的形式返回</a></span></li></ul></div>

1. DataFrame的创建：利用包含等长度列表或Numpy数组的字典，字典的键将作为columns
2. frame.head()：显示DataFrame的前5行
3. 向DataFrame传入columns参数，将按照指定顺序排序columns，如果传入的列不包含在字典的键中，将在结果中出现缺失值
4. 向DataFrame传入index参数作为行索引
5. 检索DataFrame中的一列，可按字典型标记或属性来检索，也即frame2['state']或frame2.year
6. 检索行，使用loc来检索
7. 修改列：空的'debt'可赋值为标量值或值数组
8. 将Series赋值给一列，Series的索引将按照DataFrame的索引重新排列，并在空缺的位置上填充缺失值
9. del 关键字来删除DataFrame中的列
10. DataFrame的创建：利用包含字典的嵌套字典，字典的键将作为columns，内部字典的键将作为index
11. 转置，frame3.T
12. name属性
13. values属性：DataFrame中的数据以二维数组的形式返回

In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

## DataFrame的创建：利用包含等长度列表或Numpy数组的字典，字典的键将作为columns

In [2]:
# 通过字典来生成DataFrame，字典的键为DataFrame的columns
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002, 2003],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = DataFrame(data)

In [3]:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

## frame.head()：显示DataFrame的前5行

In [4]:
frame.head() # show the first 5 lines

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9

## 向DataFrame传入columns参数，将按照指定顺序排序columns，如果传入的列不包含在字典的键中，将在结果中出现缺失值

In [5]:
DataFrame(data, columns=['year', 'state', 'pop']) # 传入columns参数，按照指定的顺序排序

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

## 向DataFrame传入index参数作为行索引

In [6]:
# 传入columns参数列不含在字典的键中，在结果中出现缺失值
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'], # columns
                   index=['one', 'two', 'three', 'four', 'five', 'six']) # index

In [7]:
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [8]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

## 检索DataFrame中的一列，可按字典型标记或属性来检索，也即frame2['state']或frame2.year

In [9]:
# 检索DataFrame中的一列，可按照字典型标记或属性那样来检索，返回对象为Series
frame2['state'] # 字典型标记检索

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [10]:
frame2.year # 属性检索

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

## 检索行，使用loc来检索

In [11]:
# 检索行可通过位置或特殊属性loc来检索
frame2.loc['three'] # 检索'three'行

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

## 修改列：空的'debt'可赋值为标量值或值数组

In [12]:
frame2['debt'] = 16.5 # 空的'debt'列赋值为标量值

In [13]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [14]:
frame2['debt'] = np.arange(6.)

In [15]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0
six    2003  Nevada  3.2   5.0

## 将Series赋值给一列，Series的索引将按照DataFrame的索引重新排列，并在空缺的位置上填充缺失值

In [16]:
# 将Series赋值给DataFrame的一列时，Series的索引将按照DataFrame的索引重新排列，并在空缺的地方填充缺失值
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [17]:
frame2['debt'] = val

In [18]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [19]:
frame2['eastern'] = frame2.state == 'Ohio' # 增加了一列

In [20]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

## del 关键字来删除DataFrame中的列

In [21]:
# del 删除列
del frame2['eastern']

In [22]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [23]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [24]:
# 包含字典的嵌套字典
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [25]:
pop

{'Nevada': {2001: 2.4, 2002: 2.9}, 'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

## DataFrame的创建：利用包含字典的嵌套字典，字典的键将作为columns，内部字典的键将作为index

In [26]:
# 使用嵌套字典生成DataFrame，字典的键将作为列，内部字典的键将作为行索引
frame3 = DataFrame(pop)

In [27]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

## 转置，frame3.T

In [28]:
frame3.T # 转置

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [31]:
pdata = {'Ohio': frame3['Ohio'][:-1], # 除最后一行的所有行
         'Nevada': frame3['Nevada'][:2]} # 前两行

In [32]:
DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4

## name属性

In [33]:
# name属性
frame3.index.name = 'year'
frame3.columns.name= 'state'

In [34]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

## values属性：DataFrame中的数据以二维数组的形式返回

In [35]:
frame3.values # 以array的形式返回

array([[nan, 1.5],
       [2.4, 1.7],
       [2.9, 3.6]])

In [37]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7],
       [2003, 'Nevada', 3.2, nan]], dtype=object)